OpenDTEF-v1912/tutorials/multiphase/interFoam/RAS/mixerVesselAMI/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

runApplication decomposePar -force
runParallel $(getApplication)
runApplication reconstructPar -noFunctionObjects

#------------------------------------------------------------------------------
